javnson/gmp_pro/ctl/suite/mcs_pmsm/project/f28p65/f28p65_0108.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28P65x" --part "F28P65x_169NMR" --package "169NMR" --context "CPU1" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.04.00.00"
 * @v2CliArgs --device "TMS320F28P650DK" --package "169NMR" --variant "TMS320F28P650DK9" --context "CPU1" --product "gmp_pro@1.00.00.05" --product "C2000WARE@5.04.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const analog         = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1        = analog.addInstance();
const can            = scripting.addModule("/driverlib/can.js", {}, false);
const can1           = can.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const ecat           = scripting.addModule("/driverlib/ecat.js", {}, false);
const ecat1          = ecat.addInstance();
const epwm           = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1          = epwm.addInstance();
const epwm2          = epwm.addInstance();
const epwm3          = epwm.addInstance();
const eqep           = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1          = eqep.addInstance();
const eqep2          = eqep.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1          = gpio.addInstance();
const gpio2          = gpio.addInstance();
const gpio3          = gpio.addInstance();
const gpio4          = gpio.addInstance();
const gpio5          = gpio.addInstance();
const gpio6          = gpio.addInstance();
const gpio7          = gpio.addInstance();
const gpio8          = gpio.addInstance();
const gpio9          = gpio.addInstance();
const gpio10         = gpio.addInstance();
const gpio11         = gpio.addInstance();
const gpio12         = gpio.addInstance();
const gpio13         = gpio.addInstance();
const gpio14         = gpio.addInstance();
const gpio15         = gpio.addInstance();
const gpio16         = gpio.addInstance();
const gpio17         = gpio.addInstance();
const gpio18         = gpio.addInstance();
const gpio19         = gpio.addInstance();
const gpio20         = gpio.addInstance();
const gpio21         = gpio.addInstance();
const other          = scripting.addModule("/driverlib/other.js", {}, false);
const other1         = other.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();
const sci2           = sci.addInstance();
const spi            = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1           = spi.addInstance();
const spi2           = spi.addInstance();
const usb            = scripting.addModule("/driverlib/usb.js", {}, false);
const usb1           = usb.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                    = "ADC_A";
adc1.soc0Name                 = "MOTOR_IU";
adc1.soc0Channel              = "ADC_CH_ADCIN7";
adc1.soc0Trigger              = "ADC_TRIGGER_EPWM5_SOCA";
adc1.soc0SampleWindow         = 15;
adc1.soc1copyFrom             = "MOTOR_IU";
adc1.soc1Name                 = "SINCOS_A";
adc1.soc1Channel              = "ADC_CH_ADCIN10";
adc1.soc1SampleWindow         = 15;
adc1.soc2Channel              = "ADC_CH_ADCIN9";
adc1.soc2SampleWindow         = 15;
adc1.soc3Name                 = "MOTOR_VBUS";
adc1.soc3Channel              = "ADC_CH_ADCIN14";
adc1.soc3SampleWindow         = 15;
adc1.soc4Name                 = "VERSION";
adc1.soc4Channel              = "ADC_CH_ADCIN15";
adc1.soc4SampleWindow         = 15;
adc1.adcClockPrescaler        = "ADC_CLK_DIV_4_0";
adc1.enabledSOCs              = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc1.soc2Name                 = "MOTOR_VBUS";
adc1.soc0IndependentNameMode  = true;
adc1.soc1IndependentNameMode  = true;
adc1.soc2IndependentNameMode  = true;
adc1.enabledInts              = ["ADC_INT_NUMBER1"];
adc1.enableInterrupt1         = true;
adc1.registerInterrupts       = ["1"];
adc1.soc2Trigger              = "ADC_TRIGGER_EPWM5_SOCA";
adc1.adcInt1.enableInterrupt  = true;
adc1.adcInt1.interruptHandler = "MainISR";

adc2.$name                   = "ADC_B";
adc2.adcBase                 = "ADCB_BASE";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc2.soc0Name                = "MOTOR_IV";
adc2.soc0Channel             = "ADC_CH_ADCIN7";
adc2.soc0SampleWindow        = 15;
adc2.soc1Name                = "TEMP_MOT";
adc2.soc1Channel             = "ADC_CH_ADCIN9";
adc2.soc1SampleWindow        = 15;
adc2.soc2Name                = "A_IN1";
adc2.soc2Channel             = "ADC_CH_ADCIN2";
adc2.soc2SampleWindow        = 15;
adc2.soc3Name                = "VERSION";
adc2.soc3Channel             = "ADC_CH_ADCIN15";
adc2.soc3SampleWindow        = 15;
adc2.soc0IndependentNameMode = true;
adc2.soc1IndependentNameMode = true;
adc2.soc2IndependentNameMode = true;
adc2.soc3IndependentNameMode = true;
adc2.soc0Trigger             = "ADC_TRIGGER_EPWM5_SOCA";

adc3.$name                   = "ADC_C";
adc3.adcBase                 = "ADCC_BASE";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2"];
adc3.soc0Name                = "MOTOR_IW";
adc3.soc0Channel             = "ADC_CH_ADCIN7";
adc3.soc0SampleWindow        = 15;
adc3.soc0Trigger             = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc1Name                = "MOT_TEMP";
adc3.soc1Channel             = "ADC_CH_ADCIN4";
adc3.soc1SampleWindow        = 15;
adc3.soc2Name                = "SINCOS_B";
adc3.soc2Channel             = "ADC_CH_ADCIN6";
adc3.soc2SampleWindow        = 15;
adc3.soc0IndependentNameMode = true;
adc3.soc1IndependentNameMode = true;
adc3.soc2IndependentNameMode = true;

