javnson/gmp_pro/ctl/suite/mcs_pmsm/project/f28p65/f28p65_0108.syscfg
can1.$name                 = "IRIS_CAN";
can1.can.can_rxPin.$assign = "GPIO5";
can1.can.can_txPin.$assign = "GPIO4";

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

dac1.$name   = "DAC_C";
dac1.dacBase = "DACC_BASE";

analog1.$name            = "myANALOGPinMux0";
adc1.analog              = analog1;
analog1.useCase          = "CUSTOM";
adc2.analog              = analog1;
adc3.analog              = analog1;
dac1.analog              = analog1;
analog1.useInterfacePins = ["A10, GPIO213","A14/B14/C14","A15/B15/C15","A7, GPIO210","A9, GPIO212","B1/DACC_OUT","B2","B7, GPIO208","B9, GPIO218","C4, GPIO205","C6, GPIO203","C7, GPIO198"];

ecat1.$name                               = "myECAT0";
ecat1.useCase                             = "CUSTOM";
ecat1.useInterfacePins                    = ["ESC_I2C_SCL","ESC_I2C_SDA","ESC_LED_ERR","ESC_LED_RUN","ESC_MDIO_CLK","ESC_MDIO_DATA","ESC_PHY0_LINKSTATUS","ESC_PHY1_LINKSTATUS","ESC_PHY_RESETn","ESC_RX0_CLK","ESC_RX0_DATA0","ESC_RX0_DATA1","ESC_RX0_DATA2","ESC_RX0_DATA3","ESC_RX0_DV","ESC_RX0_ERR","ESC_RX1_CLK","ESC_RX1_DATA0","ESC_RX1_DATA1","ESC_RX1_DATA2","ESC_RX1_DATA3","ESC_RX1_DV","ESC_RX1_ERR","ESC_TX0_CLK","ESC_TX0_DATA0","ESC_TX0_DATA1","ESC_TX0_DATA2","ESC_TX0_DATA3","ESC_TX0_ENA","ESC_TX1_CLK","ESC_TX1_DATA0","ESC_TX1_DATA1","ESC_TX1_DATA2","ESC_TX1_DATA3","ESC_TX1_ENA"];
ecat1.ecat.esc_i2c_sdaPin.$assign         = "GPIO40";
ecat1.ecat.esc_i2c_sclPin.$assign         = "GPIO30";
ecat1.ecat.esc_tx1_data3Pin.$assign       = "GPIO19";
ecat1.ecat.esc_tx1_data2Pin.$assign       = "GPIO73";
ecat1.ecat.esc_tx1_data1Pin.$assign       = "GPIO74";
ecat1.ecat.esc_tx1_data0Pin.$assign       = "GPIO22";
ecat1.ecat.esc_mdio_clkPin.$assign        = "GPIO62";
ecat1.ecat.esc_mdio_dataPin.$assign       = "GPIO27";
ecat1.ecat.esc_rx1_clkPin.$assign         = "GPIO69";
ecat1.ecat.esc_rx1_dvPin.$assign          = "GPIO70";
ecat1.ecat.esc_rx1_errPin.$assign         = "GPIO71";
ecat1.ecat.esc_rx1_data0Pin.$assign       = "GPIO63";
ecat1.ecat.esc_rx1_data1Pin.$assign       = "GPIO64";
ecat1.ecat.esc_rx1_data2Pin.$assign       = "GPIO65";
ecat1.ecat.esc_rx1_data3Pin.$assign       = "GPIO66";
ecat1.ecat.esc_phy_resetnPin.$assign      = "GPIO76";
ecat1.ecat.esc_led_runPin.$assign         = "GPIO61";
ecat1.ecat.esc_led_errPin.$assign         = "GPIO33";
ecat1.ecat.esc_rx0_clkPin.$assign         = "GPIO77";
ecat1.ecat.esc_rx0_dvPin.$assign          = "GPIO78";
ecat1.ecat.esc_rx0_errPin.$assign         = "GPIO26";
ecat1.ecat.esc_rx0_data0Pin.$assign       = "GPIO80";
ecat1.ecat.esc_rx0_data1Pin.$assign       = "GPIO28";
ecat1.ecat.esc_rx0_data2Pin.$assign       = "GPIO29";
ecat1.ecat.esc_rx0_data3Pin.$assign       = "GPIO83";
ecat1.ecat.esc_tx0_enaPin.$assign         = "GPIO56";
ecat1.ecat.esc_tx0_clkPin.$assign         = "GPIO85";
ecat1.ecat.esc_tx0_data0Pin.$assign       = "GPIO87";
ecat1.ecat.esc_tx0_data1Pin.$assign       = "GPIO88";
ecat1.ecat.esc_tx0_data2Pin.$assign       = "GPIO89";
ecat1.ecat.esc_tx0_data3Pin.$assign       = "GPIO90";
ecat1.ecat.esc_tx1_enaPin.$assign         = "GPIO45";
ecat1.ecat.esc_tx1_clkPin.$assign         = "GPIO44";
ecat1.ecat.esc_phy0_linkstatusPin.$assign = "GPIO86";
ecat1.ecat.esc_phy1_linkstatusPin.$assign = "GPIO68";

epwm1.$name                                                      = "PHASE_U";
epwm1.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_period                                        = 6250;
epwm1.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm1.epwmTimebase_phaseEnable                                   = true;
epwm1.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm1.epwmCounterCompare_cmpA                                    = 3125;
epwm1.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmDeadband_enableRED                                     = true;
epwm1.epwmDeadband_enableFED                                     = true;
epwm1.epwmDeadband_delayRED                                      = 100;
epwm1.epwmDeadband_delayFED                                      = 100;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm1.epwmEventTrigger_enableInterrupt                           = true;
epwm1.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm1.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_ZERO";
epwm1.epwmEventTrigger_interruptEventCount                       = "1";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwm.epwm_aPin.$assign                                     = "GPIO8";
epwm1.epwm.epwm_bPin.$assign                                     = "GPIO9";

epwm2.$name                                                      = "PHASE_V";
epwm2.copyUse                                                    = true;
epwm2.copyFrom                                                   = "PHASE_U";
epwm2.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_period                                        = 6250;
epwm2.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.epwmTimebase_phaseEnable                                   = true;
epwm2.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm2.epwmCounterCompare_cmpA                                    = 3125;
epwm2.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmDeadband_enableRED                                     = true;
epwm2.epwmDeadband_delayRED                                      = 100;
epwm2.epwmDeadband_enableFED                                     = true;
epwm2.epwmDeadband_delayFED                                      = 100;
epwm2.epwmEventTrigger_enableInterrupt                           = true;
epwm2.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_ZERO";
epwm2.epwmEventTrigger_interruptEventCount                       = "1";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm2.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwm.epwm_aPin.$assign                                     = "GPIO6";
epwm2.epwm.epwm_bPin.$assign                                     = "GPIO7";

epwm3.$name                                                      = "PHASE_W";
epwm3.copyUse                                                    = true;
epwm3.copyFrom                                                   = "PHASE_U";
epwm3.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_period                                        = 6250;
epwm3.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.epwmTimebase_phaseEnable                                   = true;
epwm3.epwmTimebase_syncOutPulseMode                              = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm3.epwmCounterCompare_cmpA                                    = 3125;
epwm3.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmDeadband_enableRED                                     = true;
epwm3.epwmDeadband_delayRED                                      = 100;
epwm3.epwmDeadband_enableFED                                     = true;
epwm3.epwmDeadband_delayFED                                      = 100;
epwm3.epwmEventTrigger_enableInterrupt                           = true;
epwm3.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_ZERO";
epwm3.epwmEventTrigger_interruptEventCount                       = "1";
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_ZERO";
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwm.epwm_aPin.$assign                                     = "GPIO10";
epwm3.epwm.epwm_bPin.$assign                                     = "GPIO11";

eqep1.$name                      = "EQEP_Encoder1";
eqep1.useCase                    = "NO STROBE";
eqep1.enableInterrupt            = true;
eqep1.registerInterrupts         = true;
eqep1.interruptSources           = ["EQEP_INT_INDEX_EVNT_LATCH"];
eqep1.eqep.eqep_aPin.$assign     = "GPIO15";
eqep1.eqep.eqep_bPin.$assign     = "GPIO16";
eqep1.eqep.eqep_indexPin.$assign = "GPIO18";

eqep2.useCase                    = "NO STROBE";
eqep2.$name                      = "EQEP_Encoder2";
eqep2.eqep.eqep_aPin.$assign     = "B4, GPIO215";
eqep2.eqep.eqep_bPin.$assign     = "B5, GPIO216";
eqep2.eqep.eqep_indexPin.$assign = "B8, GPIO217";

gpio1.$name           = "ENC_HA";
gpio1.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio1.gpioPin.$assign = "GPIO12";

