javnson/gmp_pro/ctl/suite/mcs_pmsm/project/f28p65/f28p65_0108.syscfg
gpio2.$name           = "ENC_HB";
gpio2.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio2.gpioPin.$assign = "GPIO13";

gpio3.$name           = "ENC_HC";
gpio3.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio3.gpioPin.$assign = "GPIO14";

gpio4.$name           = "D_OUT1";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO17";

gpio5.$name           = "D_IN3";
gpio5.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio5.gpioPin.$assign = "GPIO21";

gpio6.$name           = "N_FAULT";
gpio6.gpioPin.$assign = "GPIO20";

gpio7.$name           = "ENC2_DE";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.gpioPin.$assign = "GPIO25";

gpio8.$name           = "D_OUT3";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.gpioPin.$assign = "GPIO32";

gpio9.$name           = "D_OUT4";
gpio9.gpioPin.$assign = "GPIO34";

gpio10.$name           = "ENC1_DE";
gpio10.direction       = "GPIO_DIR_MODE_OUT";
gpio10.gpioPin.$assign = "GPIO93";

gpio11.$name           = "STO_IN1";
gpio11.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio11.gpioPin.$assign = "GPIO103";

gpio12.$name           = "STO_IN2";
gpio12.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio12.gpioPin.$assign = "GPIO99";

gpio13.$name           = "ENC1_SEL";
gpio13.direction       = "GPIO_DIR_MODE_OUT";
gpio13.gpioPin.$assign = "GPIO104";

gpio14.$name           = "ENC2_SEL";
gpio14.direction       = "GPIO_DIR_MODE_OUT";
gpio14.gpioPin.$assign = "GPIO105";

gpio15.$name           = "D_OUT2";
gpio15.direction       = "GPIO_DIR_MODE_OUT";
gpio15.gpioPin.$assign = "GPIO224/ERRORSTS";

gpio16.$name           = "D_IN4";
gpio16.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio16.gpioPin.$assign = "C1, GPIO200";

gpio17.$name           = "D_IN5";
gpio17.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio17.gpioPin.$assign = "C0, GPIO199";

gpio18.$name           = "D_IN1";
gpio18.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio18.gpioPin.$assign = "C8, GPIO202";

gpio19.$name           = "D_IN2";
gpio19.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio19.gpioPin.$assign = "C9, GPIO201";

gpio20.$name           = "LED_STS";
gpio20.direction       = "GPIO_DIR_MODE_OUT";
gpio20.gpioPin.$assign = "GPIO23";

gpio21.$name           = "LED_ERR";
gpio21.direction       = "GPIO_DIR_MODE_OUT";
gpio21.gpioPin.$assign = "GPIO24";

other1.$name            = "myOTHER0";
other1.useCase          = "CUSTOM";
other1.useInterfacePins = ["TCK","TDI","TDO","TMS","X1","XRSn"];

sci1.$name                 = "debug_uart";
sci1.sci.sci_rxPin.$assign = "GPIO35";
sci1.sci.sci_txPin.$assign = "GPIO36";
sci1.rxQual.$name          = "myGPIOQUAL0";
sci1.txQual.$name          = "myGPIOQUAL1";

sci2.$name                 = "SCI_ENCODER";
sci2.sci.sci_rxPin.$assign = "GPIO55";
sci2.sci.sci_txPin.$assign = "GPIO54";
sci2.rxQual.$name          = "myGPIOQUAL10";
sci2.txQual.$name          = "myGPIOQUAL11";

spi1.$name                   = "SPI_FLASH";
spi1.spi.spi_picoPin.$assign = "GPIO50";
spi1.spi.spi_pociPin.$assign = "GPIO51";
spi1.spi.spi_clkPin.$assign  = "GPIO52";
spi1.spi.spi_ptePin.$assign  = "GPIO53";
spi1.picoQual.$name          = "myGPIOQUAL2";
spi1.pociQual.$name          = "myGPIOQUAL3";
spi1.clkQual.$name           = "myGPIOQUAL4";
spi1.pteQual.$name           = "myGPIOQUAL5";

spi2.$name                   = "SPI_ENCODER1";
spi2.spi.spi_picoPin.$assign = "GPIO91";
spi2.spi.spi_pociPin.$assign = "GPIO92";
spi2.picoQual.$name          = "myGPIOQUAL6";
spi2.pociQual.$name          = "myGPIOQUAL7";
spi2.clkQual.$name           = "myGPIOQUAL8";
spi2.pteQual.$name           = "myGPIOQUAL9";

usb1.$name                = "DEBUG_USB";
usb1.usb.usbdmPin.$assign = "GPIO42";
usb1.usb.usbdpPin.$assign = "GPIO43";
usb1.dmQual.padConfig     = scripting.forceWrite("STD");
usb1.dpQual.padConfig     = scripting.forceWrite("STD");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
can1.can.$suggestSolution                          = "CANA";
analog1.analog.$suggestSolution                    = "ANALOG";
analog1.analog["a10, gpio213Pin"].$suggestSolution = "A10, GPIO213";
analog1.analog["a14/b14/c14Pin"].$suggestSolution  = "A14/B14/C14";
analog1.analog["a15/b15/c15Pin"].$suggestSolution  = "A15/B15/C15";
analog1.analog["a7, gpio210Pin"].$suggestSolution  = "A7, GPIO210";
analog1.analog["a9, gpio212Pin"].$suggestSolution  = "A9, GPIO212";
analog1.analog["b1/dacc_outPin"].$suggestSolution  = "B1/DACC_OUT";
analog1.analog.b2Pin.$suggestSolution              = "B2";
analog1.analog["b7, gpio208Pin"].$suggestSolution  = "B7, GPIO208";
analog1.analog["b9, gpio218Pin"].$suggestSolution  = "B9, GPIO218";
analog1.analog["c4, gpio205Pin"].$suggestSolution  = "C4, GPIO205";
analog1.analog["c6, gpio203Pin"].$suggestSolution  = "C6, GPIO203";
analog1.analog["c7, gpio198Pin"].$suggestSolution  = "C7, GPIO198";
ecat1.ecat.$suggestSolution                        = "ECAT";
epwm1.epwm.$suggestSolution                        = "EPWM5";
epwm2.epwm.$suggestSolution                        = "EPWM4";
epwm3.epwm.$suggestSolution                        = "EPWM6";
eqep1.eqep.$suggestSolution                        = "EQEP5";
eqep2.eqep.$suggestSolution                        = "EQEP3";
other1.other.$suggestSolution                      = "OTHER";
other1.other.tdoPin.$suggestSolution               = "GPIO223/TDO";
other1.other.tdiPin.$suggestSolution               = "GPIO222/TDI";
other1.other.x1Pin.$suggestSolution                = "GPIO220, X1";
sci1.sci.$suggestSolution                          = "SCIA";
sci2.sci.$suggestSolution                          = "SCIB";
spi1.spi.$suggestSolution                          = "SPIC";
spi2.spi.$suggestSolution                          = "SPID";
spi2.spi.spi_clkPin.$suggestSolution               = "GPIO75";
spi2.spi.spi_ptePin.$suggestSolution               = "GPIO221, X2";
usb1.usb.$suggestSolution                          = "USB0";
